In [1]:
import pandas as pd

# Gorilla assessment

This is the assessment for an job application for Gorilla.

## Importing the data

In [2]:
df=pd.read_excel("data.xlsx")
df

           Date    Meter ID         kWh
0    2020-10-01  1000000603   28.782474
1    2020-10-01    10588707  126.367711
2    2020-10-01    10626610  326.240595
3    2020-10-02  1000000603   26.690797
4    2020-10-02    10588707  118.322449
...         ...         ...         ...
2185 2022-09-29    10588707   77.744203
2186 2022-09-29    10626610  270.357196
2187 2022-09-30  1000000603   17.927143
2188 2022-09-30    10588707   73.335098
2189 2022-09-30    10626610  263.375674

[2190 rows x 3 columns]

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2190 entries, 0 to 2189
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      2190 non-null   datetime64[ns]
 1   Meter ID  2190 non-null   int64
 2   kWh       2190 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(1)
memory usage: 51.5 KB